In [1]:
import pandas as pd
grades = pd.Series([87, 100, 94])

In [3]:
grades

0     87
1    100
2     94
dtype: int64

In [4]:
grades[0]

87

In [5]:
grades.count()

3

In [6]:
grades.mean()

93.66666666666667

In [7]:
grades.min()

87

In [8]:
grades.max()

100

In [9]:
grades.std()

6.506407098647712

In [10]:
grades.describe()

count      3.000000
mean      93.666667
std        6.506407
min       87.000000
25%       90.500000
50%       94.000000
75%       97.000000
max      100.000000
dtype: float64

In [11]:
grades = pd.Series({'Wally': 87, 'Eva': 100, 'Jon': 94,'Jessica': 90})
grades['Eva']

100

In [12]:
grades.Wally

87

In [14]:
grades.values

array([ 87, 100,  94,  90])

In [15]:
print("im excited about Jonathan's repo this week")

im excited about Jonathan's repo this week

In [20]:
import pandas as pd

grades_dict = {'Wally': [87,96, 70], 'Eva': [100,87,90], 'Sam': [94,77,90], 'Katie':[100, 81,82], 'Bob':[83,65,85]}

In [21]:
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

In [22]:
pd.DataFrame(grades_dict, index=['Test1','Test2', 'Test3'])

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [24]:
grades.index=['Test1','Test2', 'Test3']
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [25]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [26]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

In [27]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [28]:
grades.iloc[0]

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [29]:
#I prefer iloc because indices are easier to type out rather than strings
grades.iloc[1]

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test2, dtype: int64

In [30]:
grades.at['Test2','Eva']

87

In [31]:
grades.iat[2,0]

70

In [32]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [34]:
#Wow that is really cool!!!
print("Jon's jaw literally dropped")

Jon's jaw literally dropped

In [35]:
pd.set_option('precision',2)

In [36]:
grades.mean()

Wally    84.33
Eva      92.33
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

In [37]:
#YES IT WORKED!
pd.set_option("display.precision",2)

In [38]:
grades.mean()

Wally    84.33
Eva      92.33
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

In [39]:
grades.sort_index(ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96   87   77     81   65
Test1     87  100   94    100   83

In [40]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65   87     81   77     96
Test3   85   90     82   90     70

In [41]:
print('I really enjoyed this module Jonathan. Keep it up!')

I really enjoyed this module Jonathan. Keep it up!